# 使用的编译器
CC=g++
# 预处理参数
CPPLFAGS=-I/usr/include/fastdfs			\
		 -I/usr/include/fastcommon
# 选项
CFLAGS=-Wall
# 需要链接的动态库
LIBS=-lfdfsclient	\
	 -lfastcommon	\
	 -llog4cplus
# 目录路径
# 子目标, 因为是测试,所有需要单独生成很多子目标
# 测试用
# 项目用
demo=demo
# 最终目标
target=$(demo)
ALL:$(target)

#######################################################################
# main程序
$(demo):main.o Fdfs_api.o
	$(CC) $^ $(LIBS) -o $@
	#######################################################################

# =====================================================================


#######################################################################
#                         所有程序都需要的规则
# 生成所有的.o 文件
%.o:%.cpp
	$(CC) -c $< -o $@ $(CPPLFAGS) $(CFLAGS) -g
# 项目清除
clean:
	-rm -rf *.o  $(target)

# 声明伪文件
.PHONY:clean ALL
#######################################################################
